import pandas as pd

# Bokeh Related Imports
from streamlit_bokeh import streamlit_bokeh
from bokeh.plotting import figure
from bokeh.models import ColumnDataSource, HoverTool

# Plotly Related Imports
from absent_graph import absent_graph

# Streamlit Component
import streamlit as st

# Other Library
from datetime import datetime
from pythainlp.util import thai_strftime

# ============================================================================================================================================ #
# >> CSS Injection
with open("style.css") as f:
    st.markdown(f"<style>{f.read()}</style>", unsafe_allow_html=True)

# >> Set Page Layout
st.set_page_config(page_title="ภาพรวม",
                   page_icon="📊",
                   layout='wide')

#region # Page Heading ############################################################################################################################
st.header('ภาพรวมการทำงานของสมาชิกสภาผู้แทนราษฎรและสมาชิกวุฒิสภา')
st.markdown('เนื่องจากเงินเดือนของสมาชิกสภาผู้แทนราษฎร (สส.) และสมาชิกวุฒิสภา (สว.) รวมไปถึงค่าใช้จ่ายต่าง ๆ ในการจัดประชุมสภา มาจากภาษีของประชาชน')

st.divider()
#endregion ########################################################################################################################################

#region # Absent Rate #############################################################################################################################
st.subheader('อัตราการลาหรือขาดประชุมของสมาชิก')
st.warning('**_หมายเหตุ_** อัตราการลาหรือขาดประชุมของสมาชิก อาจเกิดขึ้นจากหลายสาเหตุ เช่น การติดภารกิจอื่น การลาป่วย หรือเหตุผลส่วนตัวอื่น ๆ จึงไม่ได้สะท้อนถึงความไม่รับผิดชอบของสมาชิกเสมอไป', icon=':material/info:')
# st.warning('**_หมายเหตุ_** อัตราการขาดประชุมของสมาชิก ไม่ได้สะท้อนถึงนิสัยหรือความรับผิดชอบของสมาชิก การลา/ขาดประชุม อาจเกิดขึ้นจากปัจจัยอื่น เช่น การติดภารกิจอื่น การลาป่วย หรือเหตุส่วนตัวอื่น ๆ', icon=':material/info:')

fig = absent_graph()
st.plotly_chart(figure_or_data=fig, config = {'width': 'stretch'})

st.divider()
#endregion ########################################################################################################################################


